In [1]:
import warnings
warnings.filterwarnings('ignore')

import numpy as np
import pandas as pd

In [47]:
# observatrions
# when we do axis = 0, we drop across rows - 
# if that row has atleast ONE NULL, we will drop it 

# when we do axis = 1, we drop across columns - 
# if that COLUMN has atleast ONE NULL, we will drop it

# NaN is used in numerical cols
# None is used in categorical cols

# NaN is a floating point number
# None is None

# NaN is a garbage value, NaN == NaN is False
# None is None, None == None is True

In [3]:
import pandas as pd

data = {'Name': ['Peets Coffee', 'Starbucks', None, 'Verve', "Dinosaur Coffee"], 
        'Neighborhood': ['Downtown', 'Hollywood', 'Silver Lake', None, 'Los Feliz'],
        'Revenue': [25000, 30000, 20000, 28000, None]}

df = pd.DataFrame(data)
df

              Name Neighborhood  Revenue
0     Peets Coffee     Downtown  25000.0
1        Starbucks    Hollywood  30000.0
2             None  Silver Lake  20000.0
3            Verve         None  28000.0
4  Dinosaur Coffee    Los Feliz      NaN

In [4]:
# How can you check if a DataFrame contains any null values?
# How would you count the number of null values in each column?
# How can you drop rows that contain null values?
# How can you fill null values with a specified value like 0?
# How would you filter the DataFrame to only show rows with null values?
# What is the best way to replace null values with the mean or median value of the column?
# How can you check if a specific value in a row is null?
# How would you drop columns that have null values above a certain threshold percentage?
# How can you check if an entire row is null?
# How can you create a new column indicating whether values are null or not?

In [5]:
df

              Name Neighborhood  Revenue
0     Peets Coffee     Downtown  25000.0
1        Starbucks    Hollywood  30000.0
2             None  Silver Lake  20000.0
3            Verve         None  28000.0
4  Dinosaur Coffee    Los Feliz      NaN

In [6]:
# How can you check if a DataFrame contains any null values?
# df.isnull().sum().sum()> 
df.isnull().values.any()

True

In [7]:
# How would you count the number of null values in each column?
df.isnull().sum()

Name            1
Neighborhood    1
Revenue         1
dtype: int64

In [8]:
# How can you drop rows that contain null values?
# df.dropna()
# df.drop(subset = ['col1', 'col2'])
df.dropna(thresh = 3)

           Name Neighborhood  Revenue
0  Peets Coffee     Downtown  25000.0
1     Starbucks    Hollywood  30000.0

In [9]:
df

              Name Neighborhood  Revenue
0     Peets Coffee     Downtown  25000.0
1        Starbucks    Hollywood  30000.0
2             None  Silver Lake  20000.0
3            Verve         None  28000.0
4  Dinosaur Coffee    Los Feliz      NaN

In [10]:
df.dropna(axis = 0) 
# when we do axis = 0, we drop across rows - 
# if that row has atleast ONE NULL, we will drop it 

# when we do axis = 1, we drop across columns - 
# if that COLUMN has atleast ONE NULL, we will drop it

           Name Neighborhood  Revenue
0  Peets Coffee     Downtown  25000.0
1     Starbucks    Hollywood  30000.0

In [11]:
df

              Name Neighborhood  Revenue
0     Peets Coffee     Downtown  25000.0
1        Starbucks    Hollywood  30000.0
2             None  Silver Lake  20000.0
3            Verve         None  28000.0
4  Dinosaur Coffee    Los Feliz      NaN

In [12]:
# How can you fill null values with a specified value like 0?

df.fillna(0)

              Name Neighborhood  Revenue
0     Peets Coffee     Downtown  25000.0
1        Starbucks    Hollywood  30000.0
2                0  Silver Lake  20000.0
3            Verve            0  28000.0
4  Dinosaur Coffee    Los Feliz      0.0

In [13]:
# How would you filter the DataFrame to only show rows with null valud
df[df.isna().any(axis = 1)]

              Name Neighborhood  Revenue
2             None  Silver Lake  20000.0
3            Verve         None  28000.0
4  Dinosaur Coffee    Los Feliz      NaN

In [14]:
# What is the best way to replace null values with the mean or median value of the column?
df.fillna(df.mean())

              Name Neighborhood  Revenue
0     Peets Coffee     Downtown  25000.0
1        Starbucks    Hollywood  30000.0
2             None  Silver Lake  20000.0
3            Verve         None  28000.0
4  Dinosaur Coffee    Los Feliz  25750.0

In [15]:
df.fillna(df.median())

              Name Neighborhood  Revenue
0     Peets Coffee     Downtown  25000.0
1        Starbucks    Hollywood  30000.0
2             None  Silver Lake  20000.0
3            Verve         None  28000.0
4  Dinosaur Coffee    Los Feliz  26500.0

In [17]:
# mode

In [18]:
df

              Name Neighborhood  Revenue
0     Peets Coffee     Downtown  25000.0
1        Starbucks    Hollywood  30000.0
2             None  Silver Lake  20000.0
3            Verve         None  28000.0
4  Dinosaur Coffee    Los Feliz      NaN

In [19]:
# mode = df['Name'].mode()[0]
# mode
# df['Name'] = df['Name'].fillna(mode, inplace = True)

In [20]:
df['Name']

0       Peets Coffee
1          Starbucks
2               None
3              Verve
4    Dinosaur Coffee
Name: Name, dtype: object

In [21]:
df['Name'].mode()[0]

'Dinosaur Coffee'

In [22]:
df

              Name Neighborhood  Revenue
0     Peets Coffee     Downtown  25000.0
1        Starbucks    Hollywood  30000.0
2             None  Silver Lake  20000.0
3            Verve         None  28000.0
4  Dinosaur Coffee    Los Feliz      NaN

In [23]:
# Get the mode of the 'Name' column
mode_name = df['Name'].mode().iloc[0]

# # Replace NaN in 'Name' column with the mode
df['Name'].fillna(mode_name, inplace=True)

df

              Name Neighborhood  Revenue
0     Peets Coffee     Downtown  25000.0
1        Starbucks    Hollywood  30000.0
2  Dinosaur Coffee  Silver Lake  20000.0
3            Verve         None  28000.0
4  Dinosaur Coffee    Los Feliz      NaN

In [25]:
# How can you check if a specific value in a row is null?

pd.isnull(df.iloc[2, 1])

False

In [26]:
# How would you drop columns that have null values above a certain threshold percentage?

df.dropna(thresh = 2)

              Name Neighborhood  Revenue
0     Peets Coffee     Downtown  25000.0
1        Starbucks    Hollywood  30000.0
2  Dinosaur Coffee  Silver Lake  20000.0
3            Verve         None  28000.0
4  Dinosaur Coffee    Los Feliz      NaN

In [39]:
# How can you check if an entire row is null?
df.isna().any(axis = 1)

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [41]:
# How can you create a new column indicating whether values are null or not?
df['new_col'] = df.isna().any(axis =1 )

In [42]:
df

              Name Neighborhood  Revenue  new_col
0     Peets Coffee     Downtown  25000.0    False
1        Starbucks    Hollywood  30000.0    False
2  Dinosaur Coffee  Silver Lake  20000.0    False
3            Verve         None  28000.0     True
4  Dinosaur Coffee    Los Feliz      NaN     True

In [45]:
# How can you create a new column indicating whether values are null or not?
df['new_col'] = df.isna().all(axis = 0)

In [46]:
df

              Name Neighborhood  Revenue new_col
0     Peets Coffee     Downtown  25000.0     NaN
1        Starbucks    Hollywood  30000.0     NaN
2  Dinosaur Coffee  Silver Lake  20000.0     NaN
3            Verve         None  28000.0     NaN
4  Dinosaur Coffee    Los Feliz      NaN     NaN